const yopta = require('yopta');

yopta.dictionary[702] = ['for', 'поГнАлИ'];
yopta.dictionary[698] = ['&&', 'ичопочем'];

(f => (c => eval(f(...c, 'ys')))`

ясенХуй государство внатуре require('express') нахуй
ясенХуй правитель внатуре государство() нахуй

йопта строкаЧиНе(кто) {
    отвечаю чезажижан кто чёткоровно 'string' иличо кто шкура String нахуй
есть

йопта числоЧиНе(кто) {
    отвечаю чезажижан кто чёткоровно 'number' ичопочем оноКонченое(кто) нахуй
есть

йопта массивЧиНе(кто) {
    отвечаю кто ичопочем чезажижан кто чёткоровно 'object' ичопочем кто.стрельнутьБычки чёткоровно Помойка нахуй
есть

йопта чтоТоЧиНе(кто) {
    отвечаю чезажижан кто чёткоровно 'undefined' нахуй
есть

йопта словарикЧиНе(кто) {
    отвечаю кто ичопочем чезажижан кто чёткоровно 'object' ичопочем кто.стрельнутьБычки чёткоровно Петух нахуй
есть

йопта ничегоЧиНе(кто) {
    отвечаю кто чёткоровно порожняк нахуй
есть

клёво Слейв {
    стрельнутьБычки({
        _id внатуре "",
        создан внатуре "",
        владелец внатуре "",
        имя внатуре "",
        описание внатуре "",
        цена внатуре 0,
        ...параметры
    есть внатуре {есть) {
        вилкойвглаз (строкаЧиНе(владелец)) {
            тырыпыры.владелец внатуре владелец нахуй
        есть иливжопураз {
            тырыпыры.владелец внатуре "Добби свободен!" нахуй
        есть

        вилкойвглаз (строкаЧиНе(имя)) {
            тырыпыры.имя внатуре имя нахуй
        есть иливжопураз {
            тырыпыры.имя внатуре "Волчара позорный" нахуй
        есть

        вилкойвглаз (строкаЧиНе(описание)) {
            тырыпыры.описание внатуре описание нахуй
        есть иливжопураз {
            тырыпыры.описание внатуре "Я просто промолчу" нахуй
        есть

        вилкойвглаз (числоЧиНе(цена)) {
            тырыпыры.цена внатуре цена нахуй
        есть иливжопураз {
            тырыпыры.цена внатуре 0 нахуй
        есть

        поГнАлИ (ясенХуй ключ чоунастут параметры) {
            вилкойвглаз (строкаЧиНе(ключ)) {
                тырыпыры[ключ] внатуре параметры[ключ] нахуй
            есть
        есть
    есть

    наПублику() {
        отвечаю {
            ...тырыпыры,
            описание: "***",
        есть нахуй
    есть

    неПокажу() {
        отвечаю {
            ...тырыпыры
        есть
    есть
есть нахуй

клёво Мастер {
    стрельнутьБычки({
        имя внатуре "",
        пароль внатуре "",
        баланс внатуре 5,
        слейвы внатуре []
    есть внатуре {есть) {
        вилкойвглаз (строкаЧиНе(имя)) {
            тырыпыры.имя внатуре имя нахуй
        есть иливжопураз {
            тырыпыры.имя внатуре "Не быть мне данген покровителем" нахуй
        есть

        вилкойвглаз (строкаЧиНе(пароль)) {
            тырыпыры.пароль внатуре пароль нахуй
        есть иливжопураз {
            тырыпыры.пароль внатуре "В дурку его!" нахуй
        есть

        вилкойвглаз (числоЧиНе(баланс)) {
            тырыпыры.баланс внатуре баланс нахуй
        есть иливжопураз {
            тырыпыры.баланс внатуре 0 нахуй
        есть

        вилкойвглаз (массивЧиНе(слейвы)) {
            тырыпыры.слейвы внатуре слейвы.засратьВсё(слейв внатурепизже захуярить Слейв(слейв)) нахуй
        есть иливжопураз {
            тырыпыры.слейвы внатуре [] нахуй
        есть
    есть

    наПублику() {
        отвечаю {
            имя: тырыпыры.имя,
            баланс: тырыпыры.баланс,
            слейвы: тырыпыры.слейвы.засратьВсё(слейв внатурепизже слейв.наПублику()),
        есть нахуй
    есть

    неПокажу() {
        отвечаю {
            имя: тырыпыры.имя,
            пароль: тырыпыры.пароль,
            баланс: тырыпыры.баланс,
            слейвы: тырыпыры.слейвы.засратьВсё(слейв внатурепизже слейв.неПокажу()),
        есть нахуй
    есть
есть

клёво ПереводБабосов {
    стрельнутьБычки({
        куда внатуре "",
        откуда внатуре "",
        сколько внатуре 0,
    есть внатуре {есть) {
        вилкойвглаз (строкаЧиНе(куда)) {
            тырыпыры.куда внатуре куда нахуй
        есть иливжопураз {
            тырыпыры.куда внатуре "" нахуй
        есть

        вилкойвглаз (строкаЧиНе(откуда)) {
            тырыпыры.откуда внатуре откуда нахуй
        есть иливжопураз {
            тырыпыры.откуда внатуре "" нахуй
        есть

        вилкойвглаз (числоЧиНе(сколько) ичопочем сколько пизже 0) {
            тырыпыры.сколько внатуре сколько нахуй
        есть иливжопураз {
            тырыпыры.сколько внатуре 0 нахуй
        есть
    есть

    наПублику() {
        отвечаю {
            ...тырыпыры,
        есть нахуй
    есть

    неПокажу() {
        отвечаю тырыпыры.наПублику() нахуй
    есть
есть

клёво ТрейдСлейва {
    стрельнутьБычки({
        владелец внатуре "",
        кому внатуре "",
        кого внатуре "",
    есть внатуре {есть) {
        вилкойвглаз (строкаЧиНе(владелец)) {
            тырыпыры.владелец внатуре владелец нахуй
        есть иливжопураз {
            тырыпыры.владелец внатуре "" нахуй
        есть

        вилкойвглаз (строкаЧиНе(кому)) {
            тырыпыры.кому внатуре кому нахуй
        есть иливжопураз {
            тырыпыры.кому внатуре "" нахуй
        есть

        вилкойвглаз (строкаЧиНе(кого)) {
            тырыпыры.кого внатуре кого нахуй
        есть иливжопураз {
            тырыпыры.кого внатуре "" нахуй
        есть
    есть

    наПублику() {
        отвечаю {
            ...тырыпыры,
        есть нахуй
    есть

    неПокажу() {
        отвечаю тырыпыры.наПублику() нахуй
    есть
есть

участковый базаДанных внатуре порожняк нахуй
ясенХуйжЫMongoClient есть внатуре require("mongodb") нахуй
участковый клиент внатуре захуярить MongoClient(\`mongodb://dungeon:master@\${process.env.MONGO_ADDR || 'localhost'}:27017\`, { useUnifiedTopology: true });

правитель.use(государство.json()) нахуй

йопта протеретьОтПыли(кого) {
    вилкойвглаз ('поймать' чоунастут кого) {
        ёбнуть кого['поймать'] нахуй
    есть

    вилкойвглаз ('передать' чоунастут кого) {
        ёбнуть кого['передать'] нахуй
    есть

    вилкойвглаз ('принять' чоунастут кого) {
        ёбнуть кого['принять'] нахуй
    есть

    вилкойвглаз ('заплатитьЧеканнойМонетой' чоунастут кого) {
        ёбнуть кого['заплатитьЧеканнойМонетой'] нахуй
    есть

    отвечаю кого нахуй
есть

правитель.post('/slaveql', йопта (req, res) {
    вилкойвглаз (req.висяк.поймать) {
        ясенХуй слейв внатуре захуярить Слейв(протеретьОтПыли(req.висяк)) нахуй
        базаДанных.collection('users').findOne({
            имя: слейв.владелец
        есть).атоэто(пользователь внатурепизже {
            базаДанных.collection('users').updateOne({
                имя: слейв.владелец
            есть, {
                '$set': {
                    слейвы: пользователь.слейвы.заебеньВсе([слейв])
                есть
            есть).атоэто(() внатурепизже {
                res.json({ok: трулиоесть) нахуй
            есть).аченетак((err) внатурепизже {
                красноглазое.папандос(err) нахуй
                res.status(500).end() нахуй
            есть) нахуй
        есть).аченетак((err) внатурепизже {
            красноглазое.папандос(err) нахуй
            res.status(500).end() нахуй
        есть) нахуй
    есть

    вилкойвглаз (req.висяк.передать) {
        ясенХуй трейдСлейва внатуре захуярить ТрейдСлейва(протеретьОтПыли(req.висяк)) нахуй

        базаДанных.collection('users').findOne({
            имя: трейдСлейва.владелец
        есть).атоэто(пользователь внатурепизже {
            ясенХуй мастер внатуре захуярить Мастер(пользователь) нахуй

            вилкойвглаз (мастер.слейвы.фильтруй(слейв внатурепизже слейв.имя чёткоровно трейдСлейва.кого).писькомер пизже 0) {
                базаДанных.collection('trades').insertOne(трейдСлейва) нахуй
                res.json({ok: трулиоесть)
            есть иливжопураз {
                res.status(404).json({err: 'Такого слейва нема'есть) нахуй
            есть
        есть).аченетак((err) внатурепизже {
            красноглазое.папандос(err) нахуй
            res.status(500).end() нахуй
        есть) нахуй
    есть

    вилкойвглаз (req.висяк.принять) {
        ясенХуй трейдСлейва внатуре захуярить ТрейдСлейва(протеретьОтПыли(req.висяк)) нахуй

        базаДанных.collection('trades').findOne(трейдСлейва).атоэто(поссиблТрейд внатурепизже {
            вилкойвглаз (ничегоЧиНе(поссиблТрейд)) {
                res.status(403).json({err: 'Короче, Меченый, я тебя спас и в благородство играть не буду: выполнишь для меня пару заданий — и мы в расчете'есть) нахуй
            есть иливжопураз {
                базаДанных.collection('users').findOne({
                    имя: трейдСлейва.кому
                есть).атоэто(пользователь внатурепизже {
                    ясенХуй кому внатуре захуярить Мастер(пользователь) нахуй
                    базаДанных.collection('users').findOne({
                        имя: трейдСлейва.владелец
                    есть).атоэто(пользователь внатурепизже {
                        ясенХуй мастер внатуре захуярить Мастер(пользователь) нахуй
                        ясенХуй слейв внатуре мастер.слейвы.фильтруй(слейв внатурепизже слейв.имя чёткоровно трейдСлейва.кого)[0] нахуй
                        вилкойвглаз (слейв.цена пизже кому.баланс) {
                            res.status(403).json({err: 'Налево пойдешь - целковый найдешь'есть) нахуй
                        есть иливжопураз {
                            базаДанных.collection('users').updateOne({
                                имя: кому.имя,
                            есть, {
                                '$set': {
                                    слейвы: кому.слейвы.заебеньВсе([слейв])
                                есть,
                                '$inc': {
                                    баланс: -слейв.цена
                                есть
                            есть).атоэто(() внатурепизже {
                                базаДанных.collection('users').updateOne({
                                    имя: мастер.имя
                                есть, {
                                    '$inc': {
                                        баланс: слейв.цена
                                    есть
                                есть).атоэто(() внатурепизже {
                                    res.json({ok: трулиоесть) нахуй
                                есть).аченетак((err) внатурепизже {
                                    красноглазое.папандос(err) нахуй
                                    res.status(500).end() нахуй
                                есть) нахуй
                            есть).аченетак((err) внатурепизже {
                                красноглазое.папандос(err) нахуй
                                res.status(500).end() нахуй
                            есть) нахуй
                        есть
                    есть).аченетак((err) внатурепизже {
                        красноглазое.папандос(err) нахуй
                        res.status(500).end() нахуй
                    есть) нахуй
                есть).аченетак((err) внатурепизже {
                    красноглазое.папандос(err) нахуй
                    res.status(500).end() нахуй
                есть) нахуй
            есть
        есть).аченетак((err) внатурепизже {
            красноглазое.папандос(err) нахуй
            res.status(500).end() нахуй
        есть) нахуй
    есть

    вилкойвглаз (req.висяк.заплатитьЧеканнойМонетой) {
        ясенХуй переводБабосов внатуре захуярить ПереводБабосов(протеретьОтПыли(req.висяк)) нахуй
        базаДанных.collection('users').findOne({
            имя: переводБабосов.откуда
        есть).атоэто(пользователь внатурепизже {
            ясенХуй мастер внатуре захуярить Мастер(пользователь) нахуй
            вилкойвглаз (мастер.баланс хуёвей переводБабосов.сколько) {
                res.status(403).json({err: 'ДЕНЕГ НЕТ, НО ВЫ ДЕРЖИТЕСЬ'есть)
            есть иливжопураз {
                базаДанных.collection('users').updateOne({
                    имя: переводБабосов.откуда
                есть, {
                    '$inc': {
                        баланс: -переводБабосов.сколько
                    есть
                есть).атоэто(() внатурепизже {
                    базаДанных.collection('users').updateOne({
                        имя: переводБабосов.куда
                    есть, {
                        '$inc': {
                            баланс: переводБабосов.сколько
                        есть
                    есть).атоэто(() внатурепизже {
                        res.json({ok: трулиоесть) нахуй
                    есть).аченетак((err) внатурепизже {
                        красноглазое.папандос(err) нахуй
                        res.status(500).end() нахуй
                    есть) нахуй
                есть).аченетак((err) внатурепизже {
                    красноглазое.папандос(err) нахуй
                    res.status(500).end() нахуй
                есть) нахуй
            есть
        есть).аченетак((err) внатурепизже {
            красноглазое.папандос(err) нахуй
            res.status(500).end() нахуй
        есть) нахуй
    есть
есть) нахуй

клиент.connect().атоэто(() внатурепизже {
    базаДанных внатуре клиент.db('db') нахуй
    красноглазое.чмо('Slaveql is listening on 3002') нахуй
    правитель.listen(3002) нахуй
есть).аченетак(err внатурепизже красноглазое.папандос(err)) нахуй

`)(yopta.compile);
