const yopta = require('yopta');

yopta.dictionary[702] = ['for', 'поГнАлИ'];
yopta.dictionary[698] = ['&&', 'ичопочем'];

(f => (c => eval(f(...c, 'ys')))`

ясенХуй государство внатуре require('express') нахуй
ясенХуй напоминатель внатуре require('express-session') нахуй
ясенХуй гонецОтправлятель внатуре require('axios') нахуй
ясенХуй умныйНапоминатель внатуре require('connect-mongo')(напоминатель) нахуй
ясенХуй правитель внатуре государство() нахуй
ясенХуй мэр внатуре государство.Router() нахуй

гонецОтправлятель.defaults.baseURL внатуре \`http://\${process.env.SLAVEQL_ADDR || 'localhost'}:3002\`;

йопта строкаЧиНе(кто) {
    отвечаю чезажижан кто чёткоровно 'string' иличо кто шкура String нахуй
есть

йопта числоЧиНе(кто) {
    отвечаю чезажижан кто чёткоровно 'number' ичопочем оноКонченое(кто) нахуй
есть

йопта массивЧиНе(кто) {
    отвечаю кто ичопочем чезажижан кто чёткоровно 'object' ичопочем кто.стрельнутьБычки чёткоровно Помойка нахуй
есть

йопта чтоТоЧиНе(кто) {
    отвечаю чезажижан кто чёткоровно 'undefined' нахуй
есть

йопта словарикЧиНе(кто) {
    отвечаю кто ичопочем чезажижан кто чёткоровно 'object' ичопочем кто.стрельнутьБычки чёткоровно Петух нахуй
есть

йопта ничегоЧиНе(кто) {
    отвечаю кто чёткоровно порожняк нахуй
есть

клёво Слейв {
    стрельнутьБычки({
        _id внатуре "",
        создан внатуре "",
        владелец внатуре "",
        имя внатуре "",
        описание внатуре "",
        ценаЛовить внатуре нетрулио,
        цена внатуре 0,
        ...параметры
    есть внатуре {есть) {
        вилкойвглаз (строкаЧиНе(владелец)) {
            тырыпыры.владелец внатуре владелец нахуй
        есть иливжопураз {
            тырыпыры.владелец внатуре "Добби свободен!" нахуй
        есть

        вилкойвглаз (строкаЧиНе(имя)) {
            тырыпыры.имя внатуре имя нахуй
        есть иливжопураз {
            тырыпыры.имя внатуре "Волчара позорный" нахуй
        есть

        вилкойвглаз (строкаЧиНе(описание)) {
            тырыпыры.описание внатуре описание нахуй
        есть иливжопураз {
            тырыпыры.описание внатуре "Я просто промолчу" нахуй
        есть

        вилкойвглаз (ценаЛовить) {
            естьчо (цена) {
                аеслинайду "ноль":
                    тырыпыры.цена внатуре 0 нахуй
                    харэ нахуй
                аеслинайду "целковый":
                    тырыпыры.цена внатуре 1 нахуй
                    харэ нахуй
                аеслинайду "чекушка":
                    тырыпыры.цена внатуре 2 нахуй
                    харэ нахуй
                аеслинайду "порнушка":
                    тырыпыры.цена внатуре 3 нахуй
                    харэ нахуй
                аеслинайду "пердушка":
                    тырыпыры.цена внатуре 4 нахуй
                    харэ нахуй
                аеслинайду "засирушка":
                    тырыпыры.цена внатуре 5 нахуй
                    харэ нахуй
                аеслинайду "жучок":
                    тырыпыры.цена внатуре 6 нахуй
                    харэ нахуй
                аеслинайду "мудачок":
                    тырыпыры.цена внатуре 7 нахуй
                    харэ нахуй
                аеслинайду "хуй на воротничок":
                    тырыпыры.цена внатуре 8 нахуй
                    харэ нахуй
                аеслинайду "дурачок":
                    тырыпыры.цена внатуре 9 нахуй
                    харэ нахуй
                наотыбись:
                    тырыпыры.цена внатуре 0 нахуй
                    харэ нахуй
            есть
        есть иливжопураз {
            вилкойвглаз (числоЧиНе(цена)) {
                тырыпыры.цена внатуре цена нахуй
            есть иливжопураз {
                тырыпыры.цена внатуре 0 нахуй
            есть
        есть

        поГнАлИ (ясенХуй ключ чоунастут параметры) {
            вилкойвглаз (строкаЧиНе(ключ)) {
                тырыпыры[ключ] внатуре параметры[ключ] нахуй
            есть
        есть
    есть

    наПублику() {
        отвечаю {
            ...тырыпыры,
            описание: "***",
        есть нахуй
    есть

    неПокажу() {
        отвечаю {
            ...тырыпыры
        есть
    есть
есть нахуй

клёво Мастер {
    стрельнутьБычки({
        имя внатуре "",
        пароль внатуре "",
        баланс внатуре 5,
        слейвы внатуре []
    есть внатуре {есть) {
        вилкойвглаз (строкаЧиНе(имя)) {
            тырыпыры.имя внатуре имя нахуй
        есть иливжопураз {
            тырыпыры.имя внатуре "Не быть мне данген покровителем" нахуй
        есть

        вилкойвглаз (строкаЧиНе(пароль)) {
            тырыпыры.пароль внатуре пароль нахуй
        есть иливжопураз {
            тырыпыры.пароль внатуре "В дурку его!" нахуй
        есть

        вилкойвглаз (числоЧиНе(баланс)) {
            тырыпыры.баланс внатуре баланс нахуй
        есть иливжопураз {
            тырыпыры.баланс внатуре 0 нахуй
        есть

        вилкойвглаз (массивЧиНе(слейвы)) {
            тырыпыры.слейвы внатуре слейвы.засратьВсё(слейв внатурепизже захуярить Слейв(слейв)) нахуй
        есть иливжопураз {
            тырыпыры.слейвы внатуре [] нахуй
        есть
    есть

    наПублику() {
        отвечаю {
            имя: тырыпыры.имя,
            баланс: тырыпыры.баланс,
            слейвы: тырыпыры.слейвы.засратьВсё(слейв внатурепизже слейв.наПублику()),
        есть нахуй
    есть

    неПокажу() {
        отвечаю {
            имя: тырыпыры.имя,
            пароль: тырыпыры.пароль,
            баланс: тырыпыры.баланс,
            слейвы: тырыпыры.слейвы.засратьВсё(слейв внатурепизже слейв.неПокажу()),
        есть нахуй
    есть
есть

клёво ПереводБабосов {
    стрельнутьБычки({
        куда внатуре "",
        откуда внатуре "",
        сколько внатуре 0,
    есть внатуре {есть) {
        вилкойвглаз (строкаЧиНе(куда)) {
            тырыпыры.куда внатуре куда нахуй
        есть иливжопураз {
            тырыпыры.куда внатуре "" нахуй
        есть

        вилкойвглаз (строкаЧиНе(откуда)) {
            тырыпыры.откуда внатуре откуда нахуй
        есть иливжопураз {
            тырыпыры.откуда внатуре "" нахуй
        есть

        вилкойвглаз (числоЧиНе(сколько) ичопочем сколько пизже 0) {
            тырыпыры.сколько внатуре сколько нахуй
        есть иливжопураз {
            тырыпыры.сколько внатуре 0 нахуй
        есть
    есть

    наПублику() {
        отвечаю {
            ...тырыпыры,
        есть нахуй
    есть

    неПокажу() {
        отвечаю тырыпыры.наПублику() нахуй
    есть
есть

клёво ТрейдСлейва {
    стрельнутьБычки({
        владелец внатуре "",
        кому внатуре "",
        кого внатуре "",
    есть внатуре {есть) {
        вилкойвглаз (строкаЧиНе(владелец)) {
            тырыпыры.владелец внатуре владелец нахуй
        есть иливжопураз {
            тырыпыры.владелец внатуре "" нахуй
        есть

        вилкойвглаз (строкаЧиНе(кому)) {
            тырыпыры.кому внатуре кому нахуй
        есть иливжопураз {
            тырыпыры.кому внатуре "" нахуй
        есть

        вилкойвглаз (строкаЧиНе(кого)) {
            тырыпыры.кого внатуре кого нахуй
        есть иливжопураз {
            тырыпыры.кого внатуре "" нахуй
        есть
    есть

    наПублику() {
        отвечаю {
            ...тырыпыры,
        есть нахуй
    есть

    неПокажу() {
        отвечаю тырыпыры.наПублику() нахуй
    есть
есть

участковый базаДанных внатуре порожняк нахуй
ясенХуйжЫMongoClient есть внатуре require("mongodb") нахуй
участковый клиент внатуре захуярить MongoClient(\`mongodb://dungeon:master@\${process.env.MONGO_ADDR || 'localhost'}:27017\`, { useUnifiedTopology: true });

мэр.use(государство.json()) нахуй
мэр.use(напоминатель({
    store: захуярить умныйНапоминатель({
        client: клиент,
        dbName: 'db',
    есть),
    secret: ['Значение ключа этого даю я тебе. Однако ничего с ним сделать не сможешь ты.'],
    resave: нетрулио,
    saveUninitialized: нетрулио,
есть)) нахуй

мэр.get('/', йопта (req, res) {
  res.всёПиздуй('Дарова') нахуй
есть) нахуй

мэр.post('/registraciya', йопта(req, res) {
    ясенХуйжЫктоНахуй: имя внатуре "", пароль внатуре "" есть внатуре req.висяк нахуй

    вилкойвглаз (чоблястрокаЧиНе(имя) иличо чоблястрокаЧиНе(пароль)) {
        res.status(400).json({err: 'И ты, Брут..'есть) нахуй
        отвечаю нахуй
    есть

    базаДанных.collection('users').findOne({
        имя
    есть).атоэто(пользователь внатурепизже {
        вилкойвглаз (чобляничегоЧиНе(пользователь)) {
            res.status(403).всёПиздуй({err: 'Такий користувач вже є'есть) нахуй
        есть иливжопураз {
            базаДанных.collection('users').insertOne({
                ...захуярить Мастер({
                    имя,
                    пароль,
                есть).неПокажу(),
                создан: захуярить Date(),
            есть).атоэто(() внатурепизже {
                res.json({'ok': трулиоесть) нахуй
            есть).аченетак((err) внатурепизже {
                красноглазое.папандос(err) нахуй
                res.status(500).end() нахуй
            есть) нахуй
        есть
    есть).аченетак((err) внатурепизже {
        красноглазое.папандос(err) нахуй
        res.status(500).end() нахуй
    есть) нахуй
есть) нахуй

мэр.post('/login', йопта(req, res) {
    ясенХуйжЫктоНахуй: имя внатуре "", пароль внатуре "" есть внатуре req.висяк нахуй

    вилкойвглаз (чоблястрокаЧиНе(имя) иличо чоблястрокаЧиНе(пароль)) {
        res.status(400).json({err: 'И ты, Брут..'есть) нахуй
        отвечаю нахуй
    есть

    базаДанных.collection('users').findOne({
        имя
    есть).атоэто(пользователь внатурепизже {
        вилкойвглаз (ничегоЧиНе(пользователь)) {
            res.status(404).всёПиздуй({err: 'Такога карыстальніка няма!'есть) нахуй
        есть иливжопураз вилкойвглаз (пользователь.пароль чобляоднахуйня пароль) {
            res.status(403).всёПиздуй({err: 'Mật khẩu không hợp lệ'есть) нахуй
        есть иливжопураз {
            req.session.пользовательИмя внатуре имя нахуй
            res.json({ok: трулиоесть)
        есть
    есть).аченетак((err) внатурепизже {
        красноглазое.папандос(err) нахуй
        res.status(500).end() нахуй
    есть) нахуй
есть) нахуй

мэр.get('/polzovateli/ya', йопта(req, res) {
    вилкойвглаз (чтоТоЧиНе(req.session.пользовательИмя)) {
        res.status(403).json({err: 'Ты с логином раз на раз выйди сначала'есть) нахуй
        отвечаю нахуй
    есть

    базаДанных.collection('users').findOne({
        имя: req.session.пользовательИмя
    есть).атоэто(пользователь внатурепизже {
        ясенХуй мастер внатуре захуярить Мастер(пользователь) нахуй

        res.json({ok: мастер.неПокажу()есть) нахуй
    есть).аченетак((err) внатурепизже {
        красноглазое.папандос(err) нахуй
        res.status(500).end() нахуй
    есть) нахуй
есть) нахуй

мэр.get('/polzovateli/:kto', йопта(req, res) {
    вилкойвглаз (чтоТоЧиНе(req.session.пользовательИмя)) {
        res.status(403).json({err: 'Ты с логином раз на раз выйди сначала'есть) нахуй
        отвечаю нахуй
    есть

    ясенХуйжЫkto: кто есть внатуре req.params нахуй

    базаДанных.collection('users').findOne({
        имя: кто
    есть).атоэто(пользователь внатурепизже {
        вилкойвглаз (ничегоЧиНе(пользователь)) {
            res.status(404).всёПиздуй({err: 'Такога карыстальніка няма!'есть) нахуй
        есть иливжопураз {
            ясенХуй мастер внатуре захуярить Мастер(пользователь) нахуй

            res.json({ok: мастер.наПублику()есть) нахуй
        есть
    есть).аченетак((err) внатурепизже {
        красноглазое.папандос(err) нахуй
        res.status(500).end() нахуй
    есть) нахуй
есть) нахуй

мэр.get('/polzovateli', йопта(req, res) {
    вилкойвглаз (чтоТоЧиНе(req.session.пользовательИмя)) {
        res.status(403).json({err: 'Ты с логином раз на раз выйди сначала'есть) нахуй
        отвечаю нахуй
    есть

    базаДанных.collection('users').сигиЕсть().сидор({ создан: -1 есть).limit(50).toArray().атоэто(пользователи внатурепизже {
        res.json({ok: пользователи.засратьВсё(пользователь внатурепизже захуярить Мастер(пользователь).наПублику())есть) нахуй
    есть).аченетак((err) внатурепизже {
        красноглазое.папандос(err) нахуй
        res.status(500).end() нахуй
    есть) нахуй
есть) нахуй

йопта протеретьОтПыли(кого) {
    вилкойвглаз ('поймать' чоунастут кого) {
        ёбнуть кого['поймать'] нахуй
    есть

    вилкойвглаз ('передать' чоунастут кого) {
        ёбнуть кого['передать'] нахуй
    есть

    вилкойвглаз ('принять' чоунастут кого) {
        ёбнуть кого['принять'] нахуй
    есть

    вилкойвглаз ('заплатитьЧеканнойМонетой' чоунастут кого) {
        ёбнуть кого['заплатитьЧеканнойМонетой'] нахуй
    есть

    отвечаю кого нахуй
есть

йопта пойматьОбернуть(кого) {
    отвечаю {
        ...кого,
        поймать: трулио
    есть нахуй
есть

йопта передатьОбернуть(кого) {
    отвечаю {
        ...кого,
        передать: трулио
    есть нахуй
есть

йопта принятьОбернуть(кого) {
    отвечаю {
        ...кого,
        принять: трулио
    есть нахуй
есть

йопта заплатитьЧеканнойМонетойОбернуть(кого) {
    отвечаю {
        ...кого,
        заплатитьЧеканнойМонетой: трулио
    есть нахуй
есть

мэр.post('/sleiv/poimat', йопта(req, res) {
    вилкойвглаз (чтоТоЧиНе(req.session.пользовательИмя)) {
        res.status(403).json({err: 'Ты с логином раз на раз выйди сначала'есть) нахуй
        отвечаю нахуй
    есть

    ясенХуй слейв внатуре захуярить Слейв({
        ...req.висяк,
        владелец: req.session.пользовательИмя
    есть) нахуй

    гонецОтправлятель.post('/slaveql', пойматьОбернуть(протеретьОтПыли(слейв.неПокажу()))).атоэто(() внатурепизже {
        res.json({ok: трулиоесть) нахуй
    есть).аченетак((err) внатурепизже {
        вилкойвглаз (err.response.status чёткоровно 500) {
            res.status(500).end() нахуй
        есть иливжопураз {
            res.status(err.response.status).json(err.response.data) нахуй
        есть
    есть) нахуй
есть) нахуй

мэр.post('/sleiv/torganut', йопта(req, res) {
    вилкойвглаз (чтоТоЧиНе(req.session.пользовательИмя)) {
        res.status(403).json({err: 'Ты с логином раз на раз выйди сначала'есть) нахуй
        отвечаю нахуй
    есть

    участковыйжЫкого внатуре "", кому внатуре "" есть внатуре req.висяк нахуй

    вилкойвглаз (чоблястрокаЧиНе(кого)) {
        кого внатуре "" нахуй
    есть

    вилкойвглаз (чоблястрокаЧиНе(кому)) {
        кому внатуре "" нахуй
    есть

    ясенХуй трейдСлейва внатуре захуярить ТрейдСлейва({
        владелец: req.session.пользовательИмя,
        кому,
        кого,
    есть) нахуй

    гонецОтправлятель.post('/slaveql', передатьОбернуть(протеретьОтПыли(трейдСлейва.неПокажу()))).атоэто(() внатурепизже {
        res.json({ok: трулиоесть) нахуй
    есть).аченетак((err) внатурепизже {
        вилкойвглаз (err.response.status чёткоровно 500) {
            res.status(500).end() нахуй
        есть иливжопураз {
            res.status(err.response.status).json(err.response.data) нахуй
        есть
    есть) нахуй
есть)

мэр.post('/torg/prinyat', йопта(req, res) {
    вилкойвглаз (чтоТоЧиНе(req.session.пользовательИмя)) {
        res.status(403).json({err: 'Ты с логином раз на раз выйди сначала'есть) нахуй
        отвечаю нахуй
    есть

    участковыйжЫкого внатуре "", отКого внатуре "" есть внатуре req.висяк нахуй

    вилкойвглаз (чоблястрокаЧиНе(кого)) {
        кого внатуре "" нахуй
    есть

    вилкойвглаз (чоблястрокаЧиНе(отКого)) {
        отКого внатуре "" нахуй
    есть

    ясенХуй трейдСлейва внатуре захуярить ТрейдСлейва({
        владелец: отКого,
        кому: req.session.пользовательИмя,
        кого,
    есть) нахуй

    гонецОтправлятель.post('/slaveql', принятьОбернуть(протеретьОтПыли(трейдСлейва.неПокажу()))).атоэто(() внатурепизже {
        res.json({ok: трулиоесть) нахуй
    есть).аченетак((err) внатурепизже {
        вилкойвглаз (err.response.status чёткоровно 500) {
            res.status(500).end() нахуй
        есть иливжопураз {
            res.status(err.response.status).json(err.response.data) нахуй
        есть
    есть) нахуй
есть) нахуй

мэр.post('/babosi/otpravit', йопта(req, res) {
    вилкойвглаз (чтоТоЧиНе(req.session.пользовательИмя)) {
        res.status(403).json({err: 'Ты с логином раз на раз выйди сначала'есть) нахуй
        отвечаю нахуй
    есть

    ясенХуй отправкаБабосов внатуре захуярить ПереводБабосов({
        ...req.висяк,
        откуда: req.session.пользовательИмя,
    есть)

    гонецОтправлятель.post('/slaveql', заплатитьЧеканнойМонетойОбернуть(протеретьОтПыли(отправкаБабосов.неПокажу()))).атоэто(() внатурепизже {
        res.json({ok: трулиоесть) нахуй
    есть).аченетак((err) внатурепизже {
        вилкойвглаз (err.response.status чёткоровно 500) {
            res.status(500).end() нахуй
        есть иливжопураз {
            res.status(err.response.status).json(err.response.data) нахуй
        есть
    есть) нахуй
есть) нахуй

правитель.use('/rychka', мэр) нахуй

клиент.connect().атоэто(() внатурепизже {
    базаДанных внатуре клиент.db('db') нахуй
    красноглазое.чмо('Slarket is listening on 3001') нахуй
    правитель.listen(3001) нахуй
есть).аченетак(err внатурепизже красноглазое.папандос(err)) нахуй

`)(yopta.compile);
